<a href="https://colab.research.google.com/github/werowe/HypatiaAcademy/blob/master/basics/sqllite_getting_started.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#SQL Lite 3


SQL Light is the world's most popular database.  It is designed to be very small.  It in in every iPhone and Android phone, for example.

We can use Python to work with it.  But even with Python the way we work with it is with SQL.  Below we show some of the most common SQL commands.

Data is stored in **rows** and **columns**.

The [documentation is here](https://www.sqlite.org/lang.html)/


# So Many Databases

* Oracle
* MySQL
* PostgreSQL
* MongoDB
* Cassandra
* Google Big Table
* Microsoft SQL Server
* Redis
* ElasticSearch
* IBM DB2
* MariaDB

In [ ]:
# load SQL command line interepreter

%load_ext sql

In [ ]:
# create or connect to database

%sql sqlite:///students.db

In [ ]:
# list files to show it was created

!ls

sample_data  students.db

In [ ]:
%%sql

CREATE TABLE students
  (
    studentnumber INTEGER PRIMARY KEY AUTOINCREMENT,
    studentname text,
    phonenumber text,
    email text,
    datecreated text
  );

 * sqlite:///students.db
Done.

[]

In [ ]:
# add user to table.  Notice that we want the datecreated to be the current epoch time


%%sql

INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('William Shakespeare',"555-1212", "will@globe.uk.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

In [ ]:
%%sql


INSERT INTO students (studentname, phonenumber, email, datecreated)
VALUES ('Thomas Mann',"555-1212", "a@a.com", strftime('%s', 'now'));

 * sqlite:///students.db
1 rows affected.

[]

In [ ]:
# list rows in table
%%sql

select * from students;

 * sqlite:///students.db
Done.

[(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727785541'),
 (2, 'Thomas Mann', '555-1212', 'a@a.com', '1727785546')]

In [ ]:
# find by column value

%%sql

select * from students where email="a@a.com";

 * sqlite:///students.db
Done.

[(2, 'Thomas Mann', '555-1212', 'a@a.com', '1727785546')]

In [ ]:

import sqlite3

conn = sqlite3.connect("students.db")

cursor = conn.cursor()

sql="select * from students";


cursor.execute(sql)

#this will return all records from the "customers" table
rows = cursor.fetchall()

#check if rows were found and print them
if rows:
    print("Students Records:")
    for row in rows:
        print(row)
else:
    print("No records found.")

#save the changes
conn.commit()

#close the connection
conn.close()

Students Records:
(1, 'William Shakespeare', '555-1212', 'will@globe.uk.com', '1727785541')
(2, 'Thomas Mann', '555-1212', 'a@a.com', '1727785546')

In [ ]:
# delete all rows in table
%%sql

delete from students;

   sqlite:////students.db
 * sqlite:///students.db
3 rows affected.

[]

In [ ]:
# update data

%%sql

UPDATE students
SET studentname = "David Foster Wallace"
WHERE email = "a@a.com";

   sqlite:////students.db
 * sqlite:///students.db
1 rows affected.

[]

In [ ]:
# delete whole table

%%sql

drop table students

   sqlite:////students.db
 * sqlite:///students.db
Done.

[]